[{"id":1,"business_id":1,"business_name":"843/Eight Four Three","type":"Arts/Crafts/Decor","description":"843/Eight Four Three is a Filipinx queer owned and operated shop that strives to help the Filipino community be proud of their heritage. Selling patches, pins, and stickers, customers can fulfill the saying of being “proud to be Pinoy.”","social_media":"","email":"","instagram":"@EightFourThree","website":"http://EightFourThree.bigcartel.com","ratings":5.0},
{"id":2,"business_id":2,"business_name":"Adeling","type":"Jewelry/Makeup","description":"Adeling is a shop that celebrates the fun and beauty of Filipino culture. Each item in their shop is made or designed by artists and artisans from the Philippines as well as the diaspora. Adeling's goal is to uplift the FilAm community by fostering connection through products that highlight shared Filipino experiences.","social_media":"Insta/TikTok","email":"shopadeling@gmail.com","instagram":"@shopadeling","website":"http://www.ShopAdeling.com","ratings":5.0},
{"id":3,"business_id":3,"business_name":"Amber Agave","type":"Food/Drink","description":"Amber Agave is an Asian American founded and owned pop-up boba shop. Often participating in catering and community events in the Chicagoland area, Amber Agave crafts drinks that aim to celebrate cultural identity and reinterpret the way we experience beverage consumption.","social_media":"","email":"connect@amberagave.us","instagram":"@Amber.Agave","website":"http://AmberAgave.us","ratings":4.0},{"id":4,"business_id":4,"business_name":"Ampilfied Apparel","type":"Clothing/Accessories","description":"\"After many challenges regarding timing, doubts, and trials/errors, the dream I had of starting a small side business finally came to fruition. Inspired by my upbringing in the Philippines and being a woman IN a minority, I decided to start Ampilfied Apparel in order to create designs that bring more presence to both our Philippine culture and women empowerment in the community. Our pieces includes shirts, hoodies, shorts, joggers, sling bags, tank tops and hats.\"","social_media":"fb: Ampilfied Apparel\r\nstore: Hawthorne Mall","email":"ampilfiedapparel22@gmail.com","instagram":"@ampilfied_apparel","website":null,"ratings":5.0},
{"id":5,"business_id":5,"business_name":"Andreen's Cookies","type":"Food/Drink","description":"Andreen's Cookie Shop was started in early 2023 in a college apartment. Andreen's love for baking and dedication toward sharing her Filipino culture are at the heart of this unique business. Indulge in a mouthwatering selection of cookies, each lovingly crafted to capture your favorite Asian flavors and desserts. From the classic sweetness of yema and ube to the refreshing taste of pandan and the delectable crunch of turon, our cookies offer an unforgettable flavor experience. But that's not all! If cookies aren't your thing, we've got you covered. Explore our collection of Filipino-inspired stickers designed by Andreen herself!","social_media":"ig","email":"Andreen.isidoro@gmail.com","instagram":"@andreenscookies","website":null,"ratings":5.0},
{"id":6,"business_id":6,"business_name":"Bongga Co.","type":"Clothing/Accessories","description":"Bongga Co., inspired by the Filipino slang \"fabulous,\" was founded with a vision to uplift and inspire by spreading positivity while shedding light on the lesser-known aspects of Filipino culture through its incorporation of local slang. The brand offers a collection of aesthetic handcrafted hoodies, crewnecks, and totes, all meticulously designed in-house and produced by hand to reflect the vibrant spirit of Filipino creativity.","social_media":"Insta/TikTok:","email":"hello.bonggaco@gmail.com","instagram":"@ShopBongga.Co","website":"http://www.BonggaCo.com","ratings":4.0},
{"id":7,"business_id":7,"business_name":"Carina's Cupcakery","type":"Food/Drink","description":"Carina’s Cupcakery is a Chicagoland based home bakery. Offering local delivery and pick-up, those with a sweet tooth can enjoy Filipino flavor inspired desserts baked by Carina herself. From cupcakes and cakes to macaroons and even cupcake making lessons, satisfy your cupcake craving or book your next party with Carina!","social_media":"IG","email":"https://www.carinascupcakery.com/contact-carina","instagram":"@CarinasCupcakery","website":"http://CarinasCupcakery.com","ratings":5.0},
{"id":8,"business_id":8,"business_name":"Chorva Co.","type":"Clothing/Accessories","description":"Husband and wife Marlo & Meg were inspired to create and design products that reminded them of the motherland— Philippines. Chorva is a slang word for whatever it is you want it to be. Chorva products offers Filipino inspired designs from hoodies, crewneck sweatshirts, hats, totes, accessories, and stickers.","social_media":"ig","email":"chorva.co@gmail.com","instagram":"@chorva.co","website":null,"ratings":5.0},
{"id":9,"business_id":9,"business_name":"Crochet Cama","type":"Arts/Crafts/Decor","description":"\"I started my business recently over last summer by attending a few art markets here and there as a vendor. I started off just doing crochet for fun and gifting it to friends and family, but I have now turned my passion into items I can share with more people.\"","social_media":"ig","email":"mcamasosa@gmail.com","instagram":"@CrochetCama","website":null,"ratings":5.0},
{"id":10,"business_id":10,"business_name":"Emma's Projects","type":"Clothing/Accessories","description":"Eighteen year old Emma Fadullon is a Filipina-American creator based in the suburbs of Chicago. Emma started at thirteen, sewing scrunchies and headbands for other people to love and enjoy. We hope you can be one of those people!","social_media":"ig","email":"","instagram":"@emmasprojects","website":null,"ratings":4.0},
{"id":11,"business_id":11,"business_name":"Fernwood Barbers","type":"ETC","description":"Fernwood Barbers is a Filipino owned barbershop in Chicago. With locations in North Center and Logan Square, members of the Chicagoland community can get quality haircuts while also being surrounded by creativity, as the shop often collaborates or shows support for other community projects or hustles.","social_media":"Ig","email":"FERNWOODBARBERS@GMAIL.COM","instagram":"@FernwoodBarbers","website":"http://www.FernwoodBarbers.com","ratings":4.0},
{"id":12,"business_id":12,"business_name":"Filipinta","type":"Jewelry/Makeup","description":"Filipinta, which is a combination of the words \"Filipina” and \"pinta,\" meaning paint, is a beauty brand that enhances the beauty of the Philippine culture and people. Based in New York with worldwide shipping, Filipinta offers makeup, accessories, box sets, and candles!","social_media":"ig","email":"filipintabeauty@gmail.com","instagram":"@FilipintaBeauty","website":"http://www.Filipinta.com","ratings":5.0},
{"id":13,"business_id":13,"business_name":"FOR US, DEAR","type":"Arts/Crafts/Decor","description":"\"Handcrafted home goods made to be shared with partners, lovers, and friends\". A connection of culture for us, through Asian-flavor inspired scents. For Us, Dear. is a FIL-AM owned business founded by Alyssa Dichoso","social_media":"IG","email":"alyssadich@gmail.com","instagram":"@For.Us.Dear","website":null,"ratings":5.0},
{"id":14,"business_id":14,"business_name":"HaribyArt","type":"Arts/Crafts/Decor","description":"HaribyArt is where artistic endeavors thrive. Founded and owned by a Filipino immigrant, HaribyArt promotes Filipino culture through apparel, stationery, and art. All designs are made with love and are a constant reminder to be unapologetically Pinoy.","social_media":"tiktok: @haribyart","email":"haribypaperco@gmail.com","instagram":"","website":"http://HaribyArt.com","ratings":null},
{"id":15,"business_id":15,"business_name":"Kilig Candles Co.","type":"Arts/Crafts/Decor","description":"Kilig Candles Co., is a Canadian based eco-friendly candle brand under Truly Lifestyle Brand. Founded by Sean Blishen in 2020, Kilig offers sustainable and vegan coconut soy candles. The business works alongside Adhika, a non-profit organization to donate meals to children in the Philippines with every purchase.","social_media":"Ig","email":"hello@kiligcandleco.com","instagram":"@KiligCandleCo","website":"http://TrulyLifestyleBrand.com/collections/all-candles","ratings":null},
{"id":16,"business_id":16,"business_name":"Loren's Macarons","type":"Food/Drink","description":"\"I always had a knack for baking throughout my childhood to now and I really wanted to challenge myself by making a rather difficult dessert... French macarons! With many years of practice, I finally managed to get the recipe right and I wanted to include not only my own creative take on them, but to add my own culture, the Philippines, by infusing flavors such as ube, buko pandan, mango, etc! With each macaron I create, I not only honor the artistry of French pastry-making but also share a piece of my Filipino heritage with those who indulge in my delectable creations. It's a journey of taste, culture, and personal growth that continues to inspire me every day.\"","social_media":"ig","email":"lfaga2@illinois.edu","instagram":"@lorens._.macarons","website":"https://lorensmacarons.wixsite.com/lorensmacarons/menus?fbclid=PAZXh0bgNhZW0CMTEAAaZT-obQqDb8wx1SSLWk8FCbATB3M4wkeih5YyHXjF9NA0v0DIrC80PgDfg_aem_hrSG44MQPrAwzbw5PI69jQ","ratings":null},{"id":17,"business_id":17,"business_name":"Masiramon Chicago","type":"Food/Drink","description":"Masiramon Chicago specializes in authentic Filipino desserts and ulam (entrees) as well as Filipino inspired baked goods. My mission is to share the Filipino culture and flavors to the Chicagoland area. I enjoy incorporating Filipino flavors such as ube and calamansi like my top selling items- ube brownies and ube creme brulee.","social_media":"ig","email":"masiramon.chicago@gmail.com","instagram":"@masiramon.chicago","website":"http://linktr.ee/masiramon.chicago","ratings":null},{"id":18,"business_id":18,"business_name":"Mondaysuck","type":"Clothing/Accessories","description":"Mondaysuck is a Filipino owned, California based clothing brand inspired by streetwear and the West Coast vibe. With various apparel collections, Mondaysuck aims to create original, yet simplistic fashion pieces.","social_media":"IG","email":"service@mondaysuck.com","instagram":"@MONDAYSUCK","website":"http://Mondaysuck.com","ratings":null},{"id":19,"business_id":19,"business_name":"Morena Collective","type":"Clothing/Accessories","description":"Morena Collective strives to empower the Filipinx community through apparel that celebrates the beauty of our shared heritage. In support of their mission to amplify the voices that have long been marginalized by Western standards, a portion of every sale is donated to organizations that uplift these communities.","social_media":"IG","email":"morenacollective@gmail.com","instagram":"@morena.collective","website":null,"ratings":null},{"id":20,"business_id":20,"business_name":"MuijiStudio","type":"Arts/Crafts/Decor","description":"MuijiStudio is a small business based in Bloomington, IL. Specializing in stickers, stationery, and other accessories, owner Jenny Yip channels her heritage into her work, creating art celebrating Filipino and other Asian cultures. Her designs incorporate nostalgia, building joy and inspiring people to embrace their most authentic selves.","social_media":"IG","email":"muijistudio@gmail.com","instagram":"@MuijiStudio","website":"http://MuijiStudio.com","ratings":null},{"id":21,"business_id":21,"business_name":"Mutuc Clay Earrings","type":"Jewelry/Makeup","description":"Mutuc Clay Earrings is a Filipina owned jewelry business based Chicago, IL. With a wide selection of handmade polymer clay earrings, jewelry enthusiasts can find unique and Filipino inspired accessories with Mutuc Clay.","social_media":"IG","email":"","instagram":"@Mutuc.Clay","website":null,"ratings":null},{"id":22,"business_id":22,"business_name":"Pinny Planet","type":"Arts/Crafts/Decor","description":"Pinny Planet is a multi-fandom shop that focuses on creating merchandise to highlight the growing hobby of enamel pin collecting and to create wearable art of underrepresented groups from film/TV and pop culture. By designing stylish ITA Pin Bags fit for all shapes and sizes, Pinny Planet encourages fans and collectors from all fandoms to display/wear their pin collections and share their hobbies and passions!","social_media":"ig/tiktok","email":"pinnyplanet@gmail.com","instagram":"@pinnyplanet","website":"http://www.pinnyplanet.com","ratings":null},{"id":23,"business_id":23,"business_name":"Ruby's Fast Food","type":"Food/Drink","description":"Ruby's Fast Food is a family-owned business in Chicago, IL that serves traditional Filipino foods. They have been open since 1997, and they have even been featured by star chef Andrew Zimmern on Food Network and Travel Channel.","social_media":"IG","email":"","instagram":"@RubysFastFoodChicago","website":"http://RubysFastFoodChicago.com","ratings":null},{"id":24,"business_id":24,"business_name":"Sage Rose Co.","type":"Jewelry/Makeup","description":"SageRoseCo was created by Dani Eustaquio during her freshman year of college! Dani wanted to make her jewelry accessible for everyone, selling trendy and size-inclusive jewelry at affordable prices! SageRoseCo offers rings from sizes 5-13 (including half sizes!) as well as beaded necklaces and bracelets.","social_media":"ig/tiktok","email":"danikaeustaquio@gmail.com","instagram":"@sageroseco","website":"http://sageroseco.etsy.com","ratings":null},{"id":25,"business_id":25,"business_name":"Salamat Cookies","type":"Food/Drink","description":"Salamat Cookies is an Indiana based business that celebrates Filipino culture with one flavored cookie at a time. Offering nationwide shipping, vegan and gluten free options, anyone can enjoy Salamat cookies.","social_media":"IG","email":"eat@salamatcookies.com","instagram":"@SalamatCookies","website":"http://SalamatCookies.com","ratings":null},{"id":26,"business_id":26,"business_name":"Tita Bun Collective","type":"Clothing/Accessories","description":"Tita Bun Collective started during the pandemic as a way to find and amplify community. Through fashion and art, Tita Bun Co. highlights the beauty and voices of where we come from. Designs are proudly inspired by the Filipino culture and experience of growing up in Hawaii.","social_media":"Ig","email":"titabunco@gmail.com","instagram":"@TitaBunCo","website":"http://www.TitaBunCo.com","ratings":null},{"id":27,"business_id":27,"business_name":"Tita Mia's","type":"Food/Drink","description":"Tita Mia’s is a Filipino restaurant and Cafe located in Niles, Illinois. With a menu full of Filipino delights and desserts, satisfy your cravings at Tita Mia's!","social_media":"IG","email":"titamiasfilipinorestaurant@gmail.com","instagram":"@Tita_Mias_Filipino","website":null,"ratings":null},{"id":28,"business_id":28,"business_name":"Unreleased Grounds","type":"Food/Drink","description":"Unreleased Grounds is a Filipino owned brand selling t-shirts, hoodies, and more to establish a community and a future coffee shop.","social_media":"@UnreleasedGrounds","email":"https://unreleasedgrounds.com/pages/contact","instagram":"","website":"http://UnreleasedGrounds.com","ratings":null},{"id":29,"business_id":29,"business_name":"Veloria Coffee","type":"Food/Drink","description":"Veloria Coffee, a Filipino-owned Coffee Roaster, excels in crafting small-batch specialty coffee sourced globally. With a focus on introducing and showcasing high-quality specialty coffee from the Philippines.","social_media":"Ig\r\nFacebook: Veloria Coffee","email":"vilma@veloriacoffee.com","instagram":"@VeloriaCoffee","website":"http://VeloriaCoffee.com","ratings":null},{"id":30,"business_id":30,"business_name":"Wounded Healing Art","type":"Jewelry/Makeup","description":"Wounded Healing Art is a Pinay-owned jewelry brand. Based in the San Francisco Bay area, Wounded Healing Art aims to combine intention and style by selling and accessorizing crystals inspired by Philippine culture, AAPI influence, and the crystals themselves. Started in 2019, this brand sells online through their website, and participates in local pop-ups.","social_media":"Ig","email":"woundedhealingart@gmail.com","instagram":"@WoundedHealingArt","website":"http://www.WoundedHealingArt.com","ratings":null},{"id":31,"business_id":31,"business_name":"YPArtistry","type":"Arts/Crafts/Decor","description":"YPArtistry is a Filipina-American small business founded by Ysabelle in 2020. Ysabelle has loved drawing ever since she could remember and began crocheting since she was 8 years old. Using her passion for art and her love for animals, Ysabelle has made YPArtistry a source for animal crochet plushies, hand-designed stickers, and other handmade crafts!","social_media":"ig","email":"ypinp2@illinois.edu","instagram":"ypartistry","website":"http://ypartistry.etsy.com","ratings":null},{"id":32,"business_id":32,"business_name":"YSG Dessert Bar","type":"Food/Drink","description":"YSG Dessert Bar is a small business located in Worth, IL offering a wide variety of desserts and drinks to the Chicago suburb community. Being 100% nut free, food enthusiasts can enjoy cookies, cakes, muffins, coffee, milk tea, and more at YSG Dessert Bar!","social_media":"IG","email":"ysgdessertbar@gmail.com","instagram":"@YSGDessertBar","website":"http://YSGDessertBar.com","ratings":null}]
